{
    "Aries": [
      {
        "Degree": 0,
        "Attributes": "Passionate and Combative",
        "Description": "Enthusiastic about diving headfirst into situations or projects and fierce about trying to always be ‘top dog.’ Eager to understand any philosophy or concept. Sometimes overly aggressive, impulsive, and perhaps naive, using more forward movement than judgment."
      },
      {
        "Degree": 1,
        "Attributes": "Independent and Confident",
        "Description": "Self-willed and persistent with a productive mind and genuinely independent lifestyle. Always improving talents. Can be impetuous or try to intensely impose a particular point of view on others. There’s danger of burnout, collapse, or depression over work matters."
      },
      {
        "Degree": 2,
        "Attributes": "Humorous and Enthusiastic",
        "Description": "Fiery, honest, and funny with a quick and sharp intellect. More peace-loving than many Aries placements. Resourceful, generous, courageous, and clear-headed. May disregard spiritual sensitivity and intuition. Prone to fatigue from trying to do too much."
      },
      {
        "Degree": 3,
        "Attributes": "Bold and Loyal",
        "Description": "Often impulsive, passionate, domestic, and faithful. Usually happiest living away from the city, drawing wisdom from nature. Pleasant and driven by a sense of honor and genuine generosity. Could possibly be a bit vain, though, and have a tendency to make unproductive plans."
      },
      {
        "Degree": 4,
        "Attributes": "Creative and Persevering",
        "Description": "Strong-willed, individualistic, and big-hearted with a good sense of beauty and appreciation for fine arts. Ambitious, industrious, and tenaciously able to overcome obstacles. If wealthy, likely to fund some philanthropic cause. Could be a bit self-absorbed."
      },
      {
        "Degree": 5,
        "Attributes": "Sharp and Dominant",
        "Description": "Alert and conscious intellect that is good at analyzing things. Overcomes challenges and becomes a leader in any field chosen. Might belong to a powerful family or know prominent people. Can be restless, edgy, or anxious."
      },
      {
        "Degree": 6,
        "Attributes": "Diplomatic and Clever",
        "Description": "Sociable, tactful, and courteous, using artful negotiation rather than direct confrontation to get around problems. Vigilant and possesses a clear presence of mind. Interested in psychology, sociology, and communications. Can sometimes be cunning and secretive."
      },
      {
        "Degree": 7,
        "Attributes": "Intense and Sarcastic",
        "Description": "Emotionally complex. Always searching for answers with a penetrating intellect and acute perception. Sharp, instinctive, and magnetic. Sometimes contentious, scathing, critical, and hot-tempered (a career requiring aggressiveness can help channel this energy and even bring about fame)."
      },
      {
        "Degree": 8,
        "Attributes": "Brave and Strategic",
        "Description": "Friendly, tactful, and approachable. A loyal friend — or a formidable rival — with an intense sense of justice. Handles difficult situations with self-control, bravery, and cheerfulness, while acknowledging the talents of others. Can be reluctant to ask for help."
      },
      {
        "Degree": 9,
        "Attributes": "Bold and Successful",
        "Description": "Courageous, quiet, reflective, and observes things objectively. Works well with groups of people and the public at large, which helps achieve ambitions. Interested in symbolism, meditation, and inner needs of others. Can be irritable, destructive, or even brutal at times."
      },
      {
        "Degree": 10,
        "Attributes": "Creative and People-Pleasing",
        "Description": "Original, inventive, active, and a lover of philosophy and technology. Gentle, pleasant, and hospitable, which develops considerable ability for leadership. A bit of a flirt. Distaste for conforming to traditional or restrictive social rules. Might get lost in the desire to please others."
      },
      {
        "Degree": 11,
        "Attributes": "Sincere and Receptive",
        "Description": "Sociable, sensitive, and imaginative with strong domestic instincts. Somewhat of a dreamer. May have interest in the area of social work. Honest, generous, and makes effort to continually strengthen personal integrity. Can be a bit gullible or susceptible to influence."
      },
      {
        "Degree": 12,
        "Attributes": "Intuitive and Meticulous",
        "Description": "Energetic, spontaneous, and not easily persuaded by others. Full of initiative. Driven toward refinement and perfection; always wanting to understand the underlying fundamentals of any idea. May be self-indulgent or start things that never get finished."
      },
      {
        "Degree": 13,
        "Attributes": "Classy and Choosy",
        "Description": "Sophisticated and takes the time to be precise and accurate, which can become highly respected by colleagues. A strong sense of self-worth. Attracts devoted friends, some of whom may be very powerful. Likely to work with food, wine, or nutrition — though at times could overindulge. Faithful and generous."
      },
      {
        "Degree": 14,
        "Attributes": "Quick and Talented",
        "Description": "A good communicator. After trial and error, learns to carefully evaluate who to trust. Adaptable, bright, and perceptive. May have work or hobby that requires speediness. Could be indecisive or lack the willpower to act."
      },
      {
        "Degree": 15,
        "Attributes": "Rhythm and Oratory",
        "Description": "May work in a field that helps others or involves law and order. Courteous, accommodating, and easy-going. Might have delightful public speaking skills. Could have particular interest in dance, music, or poetry. Loves family and home. Can be materialistic and extravagant."
      },
      {
        "Degree": 16,
        "Attributes": "Leadership and Magic",
        "Description": "Contemplative, helpful, and impartial. A natural leader and protective of those who are weak. May have an interest in spiritualism, metaphysics, or magic — spending long amounts of time in solitude and meditation. Could try to hide resulting knowledge of the mysteries of nature from others."
      },
      {
        "Degree": 17,
        "Attributes": "Romantic and Elegant",
        "Description": "Honest, courteous, and capable. Enjoys peace, harmony, and has a strong desire for sophistication. Strives to be well-balanced — doesn't want to let emotions get excessive (though not always successful when young). Fascination with flirtation and sensuality. May enjoy poetry, fiction, or could become a writer. Can at times be too critical of others."
      },
      {
        "Degree": 18,
        "Attributes": "Dynamic and Capable",
        "Description": "Forward-moving, innovative, and can focus with great concentration. Sincere. Charismatic influence over others. Possibly a good actor. Marriage or committed partnership is very important. Might sometimes be overbearing, or overly concerned with money matters."
      },
      {
        "Degree": 19,
        "Attributes": "Intense and Pioneering",
        "Description": "Magnetic and shows intelligence in a low-key way. Action-oriented, resourceful, and learns intuitively rather than through academics. Might be interested in gadgets, tech, or machines. Cautious in many ways, yet still adventurous. Could possibly do work that involves foreign countries. May be interested in mysticism. Must guard against being self-centered, petty, or narrow-minded."
      },
      {
        "Degree": 20,
        "Attributes": "Intrepid and Alluring",
        "Description": "Inclusive and entrepreneurial. Active, adventurous, and charmingly disarming. May particularly enjoy comfort. Very likely to travel extensively but should be careful to follow all local laws. Can sometimes get stuck in feelings of loneliness or worries about money (which may have been spent on luxury items and travels)."
      },
      {
        "Degree": 21,
        "Attributes": "Successful and Changeable",
        "Description": "Forward-moving and ambitious. Intellectual and talented in business and finance. Can build wealth — but also must be careful not to lose it. Really tries to always be ready for clear actions with a well-balanced perspective. Important to overcome a tendency toward thinking it’s other people’s fault, rather than acknowledging personal indecisiveness or poor judgement."
      },
      {
        "Degree": 22,
        "Attributes": "Innovative and Unsuspecting",
        "Description": "Progressive, capable, fair, and careful to be honest. Original and entrepreneurial. Optimistic and active in business, tech, or academia. Refined but impressionable. Could get recognition for foresight and the amount of work put into an idea. Must learn not to be too carefree or naive; may lack the willpower to part from so-called allies, even if they’re harmful."
      },
      {
        "Degree": 23,
        "Attributes": "Sociable and Subordinate",
        "Description": "Hopeful and self-sacrificing. Strives to achieve neutrality and objectivity — sometimes to the point of letting others do all the decision-making. Possibly a socialite, organizing trendy gatherings. Fiercely sensual. May have to overcome problems associated with intense attraction to others."
      },
      {
        "Degree": 24,
        "Attributes": "Reliable and Straightforward"
      }
    ],
    "Taurus": [
      {
        "Degree": "0° Taurus",
        "Traits": "Strategy and Artistry",
        "Description": "Cannot stop until the job is done. Intricate nature subtly emerges. Problem-solver. Pleasing and shrewd personality but can build up many enemies. Natural surroundings nurture this soul. Can be aloof."
      },
      {
        "Degree": "1° Taurus",
        "Traits": "Otherworldly and Efficient",
        "Description": "Big-time dreamer and highly intelligent. Strategic thinker with a calm and cool approach. Nice to be around and polite. Gets things done. A bit of a larcenous mind."
      },
      {
        "Degree": "2° Taurus",
        "Traits": "Generous and Fancy",
        "Description": "Travel, social life, and intelligent philosophy are strongly indicated. Prone to generosity but may expect favors in return. Loves being around luxury and is pleasant as long as luxury is around."
      },
      {
        "Degree": "3° Taurus",
        "Traits": "Trustworthy and Quick-Witted",
        "Description": "Strong sense of responsibility and easily prone to guilt. Compassionate and honest with others. Capable in social work, psychology, and art. May need to work through rage issues."
      },
      {
        "Degree": "4° Taurus",
        "Traits": "Shrewd and Powerful",
        "Description": "Knowingly influential once aware of personal power. Calm, secluded, generous. Can be a bit slippery. Secrets and fictitious names. Nature nurtures this personality. May have had difficulties during childhood."
      },
      {
        "Degree": "5° Taurus",
        "Traits": "Insightful and Communicative",
        "Description": "Multi-talented yet indecisive. A penetrating perceptiveness brings about respect. Could discover something legendary. May struggle with issues around self-worth. Could be a homebody or hermit-like."
      },
      {
        "Degree": "6° Taurus",
        "Traits": "Cultured and Reliable",
        "Description": "Subtle, warm, and honest. Naturally feels responsible for things and can be prone to guilt. May be attractive and lucky. Might be interested in art, psychology, or social work. Possibly involved in reform and could build up enemies. Could have a tendency to overindulge."
      },
      {
        "Degree": "7° Taurus",
        "Traits": "Courageous and Accomplished",
        "Description": "Brave and honest. Stubborn and sometimes naive. Influential because of determination and ability to steadily work toward goals. May enjoy gardening and be a homebody. Should be careful with speculative investments."
      },
      {
        "Degree": "8° Taurus",
        "Traits": "Intelligent and Humane",
        "Description": "Bright and a quick learner. Often working to expand personal potential and willpower. Possibly interested in science, agriculture, or animals. Can be talented at teaching others. May have lots of children or students."
      },
      {
        "Degree": "9° Taurus",
        "Traits": "Ambitious and Friendly",
        "Description": "Possibly talented at public speaking or singing. Known as dependable. Can be excessive. May struggle with envy. Possibly prone to more than one romantic relationship at a time."
      },
      {
        "Degree": "10° Taurus",
        "Traits": "Independent and Cheerful",
        "Description": "Very attached to home and making comfortable surroundings. Free spirit and interested in the arts. Creative and inventive. May struggle with perfectionism."
      },
      {
        "Degree": "11° Taurus",
        "Traits": "Lucky and Egalitarian",
        "Description": "Agile and active. Tends to be fortunate. Can be a people-pleaser but expects the same in return. Good with detail work. Cultured and polished. May be arrogant at times."
      },
      {
        "Degree": "12° Taurus",
        "Traits": "Pleasant and Meticulous",
        "Description": "Friendly and cautious. Ability to develop true talent in chosen field. Good sense of taste and very interested in material things. Strives for balance but not always successful. Could be prone to jealousy in romantic life."
      },
      {
        "Degree": "13° Taurus",
        "Traits": "Leaderly and Magnetic",
        "Description": "Charismatic and commanding. Genuine. Enjoys harmonious environments and stability. Good at communication and perhaps marketing. Potentially a talented writer and public speaker. Perhaps interested in working in politics or public service. Possibly psychic. Will need to use personal power responsibly."
      },
      {
        "Degree": "14° Taurus",
        "Traits": "Self-Assured and Popular",
        "Description": "Curious and earthy. Interested in foreign countries and may live abroad. Big-hearted and courteous. May have good fortune with finances. Possibly adept at sales, importing, exporting, and bargaining. Can be a workaholic."
      },
      {
        "Degree": "15° Taurus",
        "Traits": "Classy and Cultured",
        "Description": "Lots of hard work. Interested in philosophy or religion. Can be secretive. Able to help others through knowledge gained by diligent study. Might be forceful about beliefs and opinions. Should be careful of unscrupulous allies."
      },
      {
        "Degree": "16° Taurus",
        "Traits": "Charismatic and Innovative",
        "Description": "Academic or business talent is indicated. Thinks outside the box. Original ideas may take time to be accepted. Can be truly stubborn but also steadfast. Should be careful to set realistic goals."
      },
      {
        "Degree": "17° Taurus",
        "Traits": "Creative and Intuitive",
        "Description": "Possibly talented in music, poetry, and the arts. Giving and supportive to those less fortunate. Might get tangled up in power struggles or with manipulative people. Can sometimes be restless."
      },
      {
        "Degree": "18° Taurus",
        "Traits": "Kindhearted and Inquisitive",
        "Description": "May have had a modest upbringing, but events could unfold to bring about notoriety. Benevolent. Curious and eager to gain knowledge. May feel responsible for others and can easily feel guilty."
      },
      {
        "Degree": "19° Taurus",
        "Traits": "Orderly and Intellectual",
        "Description": "Likes to take a methodical approach. Slow and steady. Fortunate with material things. Possibly talented at performance and dance. A gifted thinker. Should be careful not to be manipulative, slanderous, or jealous."
      },
      {
        "Degree": "20° Taurus",
        "Traits": "Honest and Alert",
        "Description": "Perceptive and penetrating mind. Able to be fair and impartial. Likes seeing the big picture and very analytical. Could be interested in business or social science. Philosophical. Exercises foresight to avoid unscrupulous opponents. Should be careful with allergies and diet."
      },
      {
        "Degree": "21° Taurus",
        "Traits": "Brainy and Objective",
        "Description": "Unique. Clever and compassionate yet detached and objective. Interested in mental processes, metaphor, and symbolism. Hard work and seriousness bring success, prosperity, and friends. Possible fame is indicated. Relies on assistance to complete projects. Can be withdrawn and indecisive."
      },
      {
        "Degree": "22° Taurus",
        "Traits": "Confident and Forward-Thinking",
        "Description": "Very self-assured. Likes to see the big picture, and gathers extensive knowledge in many areas. Future-minded, active, and enthusiastic. Collaborating with others — rather than isolated independence — will prevent getting in over one’s head."
      },
      {
        "Degree": "23° Taurus",
        "Traits": "Expressive and Collaborative",
        "Description": "Detail-oriented and can be finicky. Very benevolent and cares for those less fortunate. Able to come up with innovative ideas. Can be funny, social, and expressive. Able to make compromises and navigate political situations. Should be careful with savings and finances."
      },
      {
        "Degree": "24° Taurus",
        "Traits": "Composed and Sophisticated",
        "Description": "Can be innovative and entrepreneurial. Pleasant and flirtatious. Has natural leadership and influence over others. Can be forceful which leads to enemies. May have big ideas that are a bit hazy."
      },
      {
        "Degree": "25° Taurus",
        "Traits": "Creative and Refined",
        "Description": "Can be very attractive and attention-grabbing, perhaps exuding sexuality. Gifted in the arts. Possibly talented with complex mathematics. Can help settle arguments through natural diplomacy. Enjoys the little things and a harmonious home life, yet might endure power struggles."
      },
      {
        "Degree": "26° Taurus",
        "Traits": "Professional and Prepared",
        "Description": "Innovative and forward-thinking. Likes to be organized and prepared for whatever comes. Business and professionalism are indicated. Can be very successful. Might be loose with money and overly generous with others even though thrifty personally."
      },
      {
        "Degree": "27° Taurus",
        "Traits": "Spiritual and Conscientious",
        "Description": "Reliable and trusting. Has lots of ideas but can be vague about them with others. May be interested in brewing or distilling. Energetic and enthusiastic. May have good fortune due to others and must learn appreciation for it."
      },
      {
        "Degree": "28° Taurus",
        "Traits": "Energetic and Free-Spirited",
        "Description": "Lots of willpower and can be charismatic. Active and independent. Sincere and candid, sometimes to the point of offending. Can be intolerant of others’ viewpoints.  "
      },
      {
        "Degree": 29,
        "Traits": "Candid and Admirable",
        "Description": "Can be musical or a good performer. May have good luck and many friends and helpers. Creative, cultured, and bright. May come from a high-profile family. Could be interested in philanthropy and high-tech healthcare solutions. Likes to be straightforward and doesn’t mince words."
      }
    ]
  }